Repository: shimizukawa/try-rtd-l10n
Catalog: locale/*/LC_MESSAGES/man/sphinx-build.po
Languages: pt_br

source: sphinx-build manual page
pt_br: manual da página sphinx-build

source: Synopsis
pt_br: Sinopse

source: **sphinx-build** [*options*] <*sourcedir*> <*outdir*> [*filenames* ...]
pt_br: **sphinx-build** [*opções*] <*diretóriofonte*> <*diretóriosaída*> [*arquivos* ...]

source: Description
pt_br: Descrição

source: :program:`sphinx-build` generates documentation from the files in ``<sourcedir>`` and places it in the ``<outdir>``.
pt_br: :program:`sphinx-build` gera documentação dos arquivos fontes que estão em ``<diretóriofonte>`` and places it in the ``<diretóriosaída>``.

source: :program:`sphinx-build` looks for ``<sourcedir>/conf.py`` for the configuration settings. :manpage:`sphinx-quickstart(1)` may be used to generate template files, including ``conf.py``.
pt_br: :program:`sphinx-build` busca no ``<diretóriofonte>/conf.py`` por um arquivo de configurações. :manpage:`sphinx-quickstart(1)` pode ser usado para gerar modelos de arquivos, inclusive o arquivo ``conf.py``.

source: :program:`sphinx-build` can create documentation in different formats. A format is selected by specifying the builder name on the command line; it defaults to HTML. Builders can also perform other tasks related to documentation processing.
pt_br: :program:`sphinx-build` pode criar documentação em diversos formatos. Um formato é selecionado especificando o nome do construtor; o padrão é HTML. Esses construtores também pode executar outras tarefas relacionadas ao processamento da documentação.

source: By default, everything that is outdated is built. Output only for selected files can be built by specifying individual filenames.
pt_br: Por padrão tudo que estiver desatualizado é reconstruído. Saída de apenas alguns arquivos pode ser construída através da especificação individual desses arquivos.

source: List of available builders:
pt_br: Lista dos construtores disponíveis:

source: HTML file generation. This is the default builder.
pt_br: Gerador arquivo HTML. Esse é o construtor padrão.

source: HTML file generation with every HTML file named "index.html" in a separate directory.
pt_br: Geração de HTML com cada arquivo "index.html" em um diretório separado.

source: HTML file generation with all content in a single HTML file.
pt_br: Arquivo HTML único com todo o conteúdo.

source: Generates files for CHM (compiled help files) generation.
pt_br: Geração de arquivos CHM (arquivos help windows).

source: Generates files for Qt help collection generation.
pt_br: Geração arquivos coleção ajuda QT.

source: Generates files for the GNOME Devhelp help viewer.
pt_br: Geração arquivos ajuda GNOME Visualizador Devhelp.

source: Generates LaTeX output that can be compiled to a PDF document.
pt_br: Geração saida LaTeX que pode gerar um documento PDF.

source: Generates manual pages.
pt_br: Geração páginas man, manual padrão linux.

source: Generates Texinfo output that can be processed by :program:`makeinfo` to generate an Info document.
pt_br: Geração saida Texinfo que pode ser processada pelo :program:`makeinfo` para gerar documento Info.

source: Generates an ePub e-book version of the HTML output.
pt_br: Geração de um e-book ePub de saída HTML.

source: Generates a plain-text version of the documentation.
pt_br: Geração de documentação versão texto.

source: Generates Gettext message catalogs for content translation.
pt_br: Geração catálogo de mensagem Gettext para tradução de conteúdo.

source: changes
pt_br: alterações

source: Generates HTML files listing changed/added/deprecated items for the current version of the documented project.
pt_br: Geração lista de arquivos HTML alterados, adicionados, desativados na versão atual da documentação do projeto.

source: Checks the integrity of all external links in the source.
pt_br: Verificação da integridade de todos os links externos aos fontes.

source: pickle / json
pt_br: picle / json

source: Generates serialized HTML files for use in web applications.
pt_br: Geração arquivos serializados HTML para uso aplicações web.

source: Generates Docutils-native XML files.
pt_br: Geração documentação arquivos XML nativos Docutils.

source: Generates compact pretty-printed "pseudo-XML" files displaying the internal structure of the intermediate document trees.
pt_br: Geração documentação compacta de "pseudo-XML" que exibem a estrutura interna de documentação das estruturas do documento.

source: Options
pt_br: Opções

source: Builder to use; defaults to html. See the full list of builders above.
pt_br: Construtor para usar; padrão é html. Ver a lista completa dos construtores acima.

source: Generate output for all files; without this option only output for new and changed files is generated.
pt_br: Gerar saída para todos arquivos; sem essa opção somente serão gerados arquivos novos ou modificados.

source: Ignore cached files, forces to re-read all source files from disk.
pt_br: Ignorar arquivos no cache, forçar a re-leitura de todos arquivos fontes a partir do disco.

source: Path to cached files; defaults to <outdir>/.doctrees.
pt_br: Caminho para arquivos do cache; padrão para <diretóriosaída>/.doctrees.

source: Build in parallel with N processes where possible.
pt_br: Construir em paralelo concomitante com N processos onde possível.

source: Locate the conf.py file in the specified path instead of <sourcedir>.
pt_br: Localizar o arquivo conf.py no caminho especificado em vez de <diretóriofonte>.

source: Specify that no conf.py file at all is to be used. Configuration can only be set with the -D option.
pt_br: Especificar que no arquivo conf.py tudo será usado. Configuração pode ser configurada com opção -D.

source: Override a setting from the configuration file.
pt_br: Sobrepor configuração do arquivo de configurações.

source: Define *tag* for use in "only" blocks.
pt_br: Definir *tag* para usar "somente" nos blocos.

source: Pass a value into the HTML templates (only for HTML builders).
pt_br: Passar um valor para o padrão de HTML (só para construtor HTML).

source: Run in nit-picky mode, warn about all missing references.
pt_br: Executar no modo nit-picky, aviso para todas referências faltantes.

source: Increase verbosity (can be repeated).
pt_br: Aumentar detalhes das mensagens (pode ser repetido).

source: Prevent colored output.
pt_br: Previnir saída colorida.

source: Quiet operation, just print warnings and errors on stderr.
pt_br: Operação silenciosa, apenas imprimir avisos e erros na console stderr.

source: Very quiet operation, don't print anything except for errors.
pt_br: Operação mais quieta, não imprime nenhum erro de exceção.

source: Write warnings and errors into the given file, in addition to stderr.
pt_br: Gravar avisos e erros em um determinado arquivo, adicionalmente ao stderr.

source: Turn warnings into errors.
pt_br: Tornar avisos em erros.

source: Show full traceback on exception.
pt_br: Exibir rastreabilidade completa da exceção.

source: Run Pdb on exception.
pt_br: Executar Pdb na exceção.

source: See also
pt_br: Ver também

source: Author
pt_br: Autor

source: Georg Brandl <georg@python.org>, Armin Ronacher <armin.ronacher@active-4.com> et al.
pt_br: Georg Brandl <georg@python.org>, Armin Ronacher <armin.ronacher@active-4.com> e outros.

source: This manual page was initially written by Mikhail Gusarov <dottedmag@dottedmag.net>, for the Debian project.
pt_br: Essa página do manual foi inicialmente escrita por Mikhail Gusarov <dottedmag@dottedmag.net>, para o projeto Debian.
